MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP16GS504/mcu.h
#define ADCAL0L ADCAL0L
extern volatile uint16_t ADCAL0L __attribute__((__sfr__));
typedef struct tagADCAL0LBITS {
  uint16_t CAL0RUN:1;
  uint16_t CAL0EN:1;
  uint16_t CAL0DIFF:1;
  uint16_t CAL0SKIP:1;
  uint16_t :3;
  uint16_t CAL0RDY:1;
  uint16_t CAL1RUN:1;
  uint16_t CAL1EN:1;
  uint16_t CAL1DIFF:1;
  uint16_t CAL1SKIP:1;
  uint16_t :3;
  uint16_t CAL1RDY:1;
} ADCAL0LBITS;
extern volatile ADCAL0LBITS ADCAL0Lbits __attribute__((__sfr__));

#define ADCAL0H ADCAL0H
extern volatile uint16_t ADCAL0H __attribute__((__sfr__));
typedef struct tagADCAL0HBITS {
  uint16_t CAL2RUN:1;
  uint16_t CAL2EN:1;
  uint16_t CAL2DIFF:1;
  uint16_t CAL2SKIP:1;
  uint16_t :3;
  uint16_t CAL2RDY:1;
  uint16_t CAL3RUN:1;
  uint16_t CAL3EN:1;
  uint16_t CAL3DIFF:1;
  uint16_t CAL3SKIP:1;
  uint16_t :3;
  uint16_t CAL3RDY:1;
} ADCAL0HBITS;
extern volatile ADCAL0HBITS ADCAL0Hbits __attribute__((__sfr__));

#define ADCAL1H ADCAL1H
extern volatile uint16_t ADCAL1H __attribute__((__sfr__));
typedef struct tagADCAL1HBITS {
  uint16_t :8;
  uint16_t CSHRRUN:1;
  uint16_t CSHREN:1;
  uint16_t CSHRDIFF:1;
  uint16_t CSHRSKIP:1;
  uint16_t :3;
  uint16_t CSHRRDY:1;
} ADCAL1HBITS;
extern volatile ADCAL1HBITS ADCAL1Hbits __attribute__((__sfr__));

#define ADCBUF0 ADCBUF0
extern volatile uint16_t ADCBUF0 __attribute__((__sfr__));
#define ADCBUF1 ADCBUF1
extern volatile uint16_t ADCBUF1 __attribute__((__sfr__));
#define ADCBUF2 ADCBUF2
extern volatile uint16_t ADCBUF2 __attribute__((__sfr__));
#define ADCBUF3 ADCBUF3
extern volatile uint16_t ADCBUF3 __attribute__((__sfr__));
#define ADCBUF4 ADCBUF4
extern volatile uint16_t ADCBUF4 __attribute__((__sfr__));
#define ADCBUF5 ADCBUF5
extern volatile uint16_t ADCBUF5 __attribute__((__sfr__));
#define ADCBUF6 ADCBUF6
extern volatile uint16_t ADCBUF6 __attribute__((__sfr__));
#define ADCBUF7 ADCBUF7
extern volatile uint16_t ADCBUF7 __attribute__((__sfr__));
#define ADCBUF8 ADCBUF8
extern volatile uint16_t ADCBUF8 __attribute__((__sfr__));
#define ADCBUF9 ADCBUF9
extern volatile uint16_t ADCBUF9 __attribute__((__sfr__));
#define ADCBUF10 ADCBUF10
extern volatile uint16_t ADCBUF10 __attribute__((__sfr__));
#define ADCBUF11 ADCBUF11
extern volatile uint16_t ADCBUF11 __attribute__((__sfr__));
#define ADCBUF12 ADCBUF12
extern volatile uint16_t ADCBUF12 __attribute__((__sfr__));
#define ADCBUF14 ADCBUF14
extern volatile uint16_t ADCBUF14 __attribute__((__sfr__));
#define ADCBUF17 ADCBUF17
extern volatile uint16_t ADCBUF17 __attribute__((__sfr__));
#define ADCBUF18 ADCBUF18
extern volatile uint16_t ADCBUF18 __attribute__((__sfr__));
#define ADCBUF19 ADCBUF19
extern volatile uint16_t ADCBUF19 __attribute__((__sfr__));
#define ADCBUF20 ADCBUF20
extern volatile uint16_t ADCBUF20 __attribute__((__sfr__));
#define ADCBUF21 ADCBUF21
extern volatile uint16_t ADCBUF21 __attribute__((__sfr__));
#define ISRCCON ISRCCON
extern volatile uint16_t ISRCCON __attribute__((__sfr__));
__extension__ typedef struct tagISRCCONBITS {
  union {
    struct {
      uint16_t ISRCCAL:6;
      uint16_t :2;
      uint16_t OUTSEL:3;
      uint16_t :4;
      uint16_t ISRCEN:1;
    };
    struct {
      uint16_t ISRCCAL0:1;
      uint16_t ISRCCAL1:1;
      uint16_t ISRCCAL2:1;
      uint16_t ISRCCAL3:1;
      uint16_t ISRCCAL4:1;
      uint16_t ISRCCAL5:1;
      uint16_t :2;
      uint16_t OUTSEL0:1;
      uint16_t OUTSEL1:1;
      uint16_t OUTSEL2:1;
    };
  };
} ISRCCONBITS;
extern volatile ISRCCONBITS ISRCCONbits __attribute__((__sfr__));

#define PGA1CON PGA1CON
extern volatile uint16_t PGA1CON __attribute__((__sfr__));
__extension__ typedef struct tagPGA1CONBITS {
  union {
    struct {
      uint16_t GAIN:3;
      uint16_t :5;
      uint16_t SELNI:3;
      uint16_t SELPI:3;
      uint16_t PGAOEN:1;
      uint16_t PGAEN:1;
    };
    struct {
      uint16_t GAIN0:1;
      uint16_t GAIN1:1;
      uint16_t GAIN2:1;
      uint16_t :5;
      uint16_t SELNI0:1;
      uint16_t SELNI1:1;
      uint16_t SELNI2:1;
      uint16_t SELPI0:1;
      uint16_t SELPI1:1;
      uint16_t SELPI2:1;
    };
  };
} PGA1CONBITS;
extern volatile PGA1CONBITS PGA1CONbits __attribute__((__sfr__));

#define PGA1CAL PGA1CAL
extern volatile uint16_t PGA1CAL __attribute__((__sfr__));
typedef struct tagPGA1CALBITS {
  uint16_t PGACAL:6;
} PGA1CALBITS;
extern volatile PGA1CALBITS PGA1CALbits __attribute__((__sfr__));

#define PGA2CON PGA2CON
extern volatile uint16_t PGA2CON __attribute__((__sfr__));
__extension__ typedef struct tagPGA2CONBITS {
  union {
    struct {
      uint16_t GAIN:3;
      uint16_t :5;
      uint16_t SELNI:3;
      uint16_t SELPI:3;
      uint16_t PGAOEN:1;
      uint16_t PGAEN:1;
    };
    struct {
      uint16_t GAIN0:1;
      uint16_t GAIN1:1;
      uint16_t GAIN2:1;
      uint16_t :5;
      uint16_t SELNI0:1;
      uint16_t SELNI1:1;
      uint16_t SELNI2:1;
      uint16_t SELPI0:1;
      uint16_t SELPI1:1;
      uint16_t SELPI2:1;
    };
  };
} PGA2CONBITS;
extern volatile PGA2CONBITS PGA2CONbits __attribute__((__sfr__));

#define PGA2CAL PGA2CAL
extern volatile uint16_t PGA2CAL __attribute__((__sfr__));
typedef struct tagPGA2CALBITS {
  uint16_t PGACAL:6;
} PGA2CALBITS;
extern volatile PGA2CALBITS PGA2CALbits __attribute__((__sfr__));

#define CMP1CON CMP1CON
extern volatile uint16_t CMP1CON __attribute__((__sfr__));
__extension__ typedef struct tagCMP1CONBITS {
  union {
    struct {
      uint16_t RANGE:1;
      uint16_t CMPPOL:1;
      uint16_t ALTINP:1;
      uint16_t CMPSTAT:1;
      uint16_t HYSPOL:1;
      uint16_t EXTREF:1;
      uint16_t INSEL:2;
      uint16_t DACOE:1;
      uint16_t FCLKSEL:1;
      uint16_t FLTREN:1;
      uint16_t HYSSEL:2;
      uint16_t CMPSIDL:1;
      uint16_t :1;
      uint16_t CMPON:1;
    };
    struct {
      uint16_t :6;
      uint16_t INSEL0:1;
      uint16_t INSEL1:1;
      uint16_t :3;
      uint16_t HYSSEL0:1;
      uint16_t HYSSEL1:1;
    };
  };
} CMP1CONBITS;
extern volatile CMP1CONBITS CMP1CONbits __attribute__((__sfr__));

#define CMP1DAC CMP1DAC
extern volatile uint16_t CMP1DAC __attribute__((__sfr__));
__extension__ typedef struct tagCMP1DACBITS {
  union {
    struct {
      uint16_t CMREF:12;
    };
    struct {
      uint16_t CMREF0:1;
      uint16_t CMREF1:1;
      uint16_t CMREF2:1;
      uint16_t CMREF3:1;
      uint16_t CMREF4:1;
      uint16_t CMREF5:1;
      uint16_t CMREF6:1;
      uint16_t CMREF7:1;
      uint16_t CMREF8:1;
      uint16_t CMREF9:1;
      uint16_t CMREF10:1;
      uint16_t CMREF11:1;
    };
  };
} CMP1DACBITS;
extern volatile CMP1DACBITS CMP1DACbits __attribute__((__sfr__));

#define CMP2CON CMP2CON
extern volatile uint16_t CMP2CON __attribute__((__sfr__));
__extension__ typedef struct tagCMP2CONBITS {
  union {
    struct {
      uint16_t RANGE:1;
      uint16_t CMPPOL:1;
      uint16_t ALTINP:1;
      uint16_t CMPSTAT:1;
      uint16_t HYSPOL:1;
      uint16_t EXTREF:1;
      uint16_t INSEL:2;
      uint16_t DACOE:1;
      uint16_t FCLKSEL:1;
      uint16_t FLTREN:1;
      uint16_t HYSSEL:2;
      uint16_t CMPSIDL:1;
      uint16_t :1;
      uint16_t CMPON:1;
    };
    struct {
      uint16_t :6;
      uint16_t INSEL0:1;
      uint16_t INSEL1:1;
      uint16_t :3;
      uint16_t HYSSEL0:1;
      uint16_t HYSSEL1:1;
    };
  };
} CMP2CONBITS;
extern volatile CMP2CONBITS CMP2CONbits __attribute__((__sfr__));

