MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP16GS504/mcu.h
#define RPOR6 RPOR6
extern volatile uint16_t RPOR6 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR6BITS {
  union {
    struct {
      uint16_t RP44R:6;
      uint16_t :2;
      uint16_t RP45R:6;
    };
    struct {
      uint16_t RP44R0:1;
      uint16_t RP44R1:1;
      uint16_t RP44R2:1;
      uint16_t RP44R3:1;
      uint16_t RP44R4:1;
      uint16_t RP44R5:1;
      uint16_t :2;
      uint16_t RP45R0:1;
      uint16_t RP45R1:1;
      uint16_t RP45R2:1;
      uint16_t RP45R3:1;
      uint16_t RP45R4:1;
      uint16_t RP45R5:1;
    };
  };
} RPOR6BITS;
extern volatile RPOR6BITS RPOR6bits __attribute__((__sfr__));

#define RPOR7 RPOR7
extern volatile uint16_t RPOR7 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR7BITS {
  union {
    struct {
      uint16_t RP46R:6;
      uint16_t :2;
      uint16_t RP47R:6;
    };
    struct {
      uint16_t RP46R0:1;
      uint16_t RP46R1:1;
      uint16_t RP46R2:1;
      uint16_t RP46R3:1;
      uint16_t RP46R4:1;
      uint16_t RP46R5:1;
      uint16_t :2;
      uint16_t RP47R0:1;
      uint16_t RP47R1:1;
      uint16_t RP47R2:1;
      uint16_t RP47R3:1;
      uint16_t RP47R4:1;
      uint16_t RP47R5:1;
    };
  };
} RPOR7BITS;
extern volatile RPOR7BITS RPOR7bits __attribute__((__sfr__));

#define RPOR8 RPOR8
extern volatile uint16_t RPOR8 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR8BITS {
  union {
    struct {
      uint16_t RP48R:6;
      uint16_t :2;
      uint16_t RP49R:6;
    };
    struct {
      uint16_t RP48R0:1;
      uint16_t RP48R1:1;
      uint16_t RP48R2:1;
      uint16_t RP48R3:1;
      uint16_t RP48R4:1;
      uint16_t RP48R5:1;
      uint16_t :2;
      uint16_t RP49R0:1;
      uint16_t RP49R1:1;
      uint16_t RP49R2:1;
      uint16_t RP49R3:1;
      uint16_t RP49R4:1;
      uint16_t RP49R5:1;
    };
  };
} RPOR8BITS;
extern volatile RPOR8BITS RPOR8bits __attribute__((__sfr__));

#define RPOR9 RPOR9
extern volatile uint16_t RPOR9 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR9BITS {
  union {
    struct {
      uint16_t RP50R:6;
      uint16_t :2;
      uint16_t RP51R:6;
    };
    struct {
      uint16_t RP50R0:1;
      uint16_t RP50R1:1;
      uint16_t RP50R2:1;
      uint16_t RP50R3:1;
      uint16_t RP50R4:1;
      uint16_t RP50R5:1;
      uint16_t :2;
      uint16_t RP51R0:1;
      uint16_t RP51R1:1;
      uint16_t RP51R2:1;
      uint16_t RP51R3:1;
      uint16_t RP51R4:1;
      uint16_t RP51R5:1;
    };
  };
} RPOR9BITS;
extern volatile RPOR9BITS RPOR9bits __attribute__((__sfr__));

#define RPOR10 RPOR10
extern volatile uint16_t RPOR10 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR10BITS {
  union {
    struct {
      uint16_t RP52R:6;
      uint16_t :2;
      uint16_t RP53R:6;
    };
    struct {
      uint16_t RP52R0:1;
      uint16_t RP52R1:1;
      uint16_t RP52R2:1;
      uint16_t RP52R3:1;
      uint16_t RP52R4:1;
      uint16_t RP52R5:1;
      uint16_t :2;
      uint16_t RP53R0:1;
      uint16_t RP53R1:1;
      uint16_t RP53R2:1;
      uint16_t RP53R3:1;
      uint16_t RP53R4:1;
      uint16_t RP53R5:1;
    };
  };
} RPOR10BITS;
extern volatile RPOR10BITS RPOR10bits __attribute__((__sfr__));

#define RPOR11 RPOR11
extern volatile uint16_t RPOR11 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR11BITS {
  union {
    struct {
      uint16_t RP54R:6;
      uint16_t :2;
      uint16_t RP55R:6;
    };
    struct {
      uint16_t RP54R0:1;
      uint16_t RP54R1:1;
      uint16_t RP54R2:1;
      uint16_t RP54R3:1;
      uint16_t RP54R4:1;
      uint16_t RP54R5:1;
      uint16_t :2;
      uint16_t RP55R0:1;
      uint16_t RP55R1:1;
      uint16_t RP55R2:1;
      uint16_t RP55R3:1;
      uint16_t RP55R4:1;
      uint16_t RP55R5:1;
    };
  };
} RPOR11BITS;
extern volatile RPOR11BITS RPOR11bits __attribute__((__sfr__));

#define RPOR12 RPOR12
extern volatile uint16_t RPOR12 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR12BITS {
  union {
    struct {
      uint16_t RP56R:6;
      uint16_t :2;
      uint16_t RP57R:6;
    };
    struct {
      uint16_t RP56R0:1;
      uint16_t RP56R1:1;
      uint16_t RP56R2:1;
      uint16_t RP56R3:1;
      uint16_t RP56R4:1;
      uint16_t RP56R5:1;
      uint16_t :2;
      uint16_t RP57R0:1;
      uint16_t RP57R1:1;
      uint16_t RP57R2:1;
      uint16_t RP57R3:1;
      uint16_t RP57R4:1;
      uint16_t RP57R5:1;
    };
  };
} RPOR12BITS;
extern volatile RPOR12BITS RPOR12bits __attribute__((__sfr__));

#define RPOR13 RPOR13
extern volatile uint16_t RPOR13 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR13BITS {
  union {
    struct {
      uint16_t RP58R:6;
      uint16_t :2;
      uint16_t RP59R:6;
    };
    struct {
      uint16_t RP58R0:1;
      uint16_t RP58R1:1;
      uint16_t RP58R2:1;
      uint16_t RP58R3:1;
      uint16_t RP58R4:1;
      uint16_t RP58R5:1;
      uint16_t :2;
      uint16_t RP59R0:1;
      uint16_t RP59R1:1;
      uint16_t RP59R2:1;
      uint16_t RP59R3:1;
      uint16_t RP59R4:1;
      uint16_t RP59R5:1;
    };
  };
} RPOR13BITS;
extern volatile RPOR13BITS RPOR13bits __attribute__((__sfr__));

#define RPOR14 RPOR14
extern volatile uint16_t RPOR14 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR14BITS {
  union {
    struct {
      uint16_t RP60R:6;
      uint16_t :2;
      uint16_t RP61R:6;
    };
    struct {
      uint16_t RP60R0:1;
      uint16_t RP60R1:1;
      uint16_t RP60R2:1;
      uint16_t RP60R3:1;
      uint16_t RP60R4:1;
      uint16_t RP60R5:1;
      uint16_t :2;
      uint16_t RP61R0:1;
      uint16_t RP61R1:1;
      uint16_t RP61R2:1;
      uint16_t RP61R3:1;
      uint16_t RP61R4:1;
      uint16_t RP61R5:1;
    };
  };
} RPOR14BITS;
extern volatile RPOR14BITS RPOR14bits __attribute__((__sfr__));

#define RPOR15 RPOR15
extern volatile uint16_t RPOR15 __attribute__((__sfr__));
#define RPOR16 RPOR16
extern volatile uint16_t RPOR16 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR16BITS {
  union {
    struct {
      uint16_t RP176R:6;
      uint16_t :2;
      uint16_t RP177R:6;
    };
    struct {
      uint16_t RP176R0:1;
      uint16_t RP176R1:1;
      uint16_t RP176R2:1;
      uint16_t RP176R3:1;
      uint16_t RP176R4:1;
      uint16_t RP176R5:1;
      uint16_t :2;
      uint16_t RP177R0:1;
      uint16_t RP177R1:1;
      uint16_t RP177R2:1;
      uint16_t RP177R3:1;
      uint16_t RP177R4:1;
      uint16_t RP177R5:1;
    };
  };
} RPOR16BITS;
extern volatile RPOR16BITS RPOR16bits __attribute__((__sfr__));

