MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP16GS504/mcu.h
extern volatile IPC16BITS IPC16bits __attribute__((__sfr__));

#define IPC18 IPC18
extern volatile uint16_t IPC18 __attribute__((__sfr__));
__extension__ typedef struct tagIPC18BITS {
  union {
    struct {
      uint16_t :4;
      uint16_t PSESIP:3;
    };
    struct {
      uint16_t :4;
      uint16_t PSESIP0:1;
      uint16_t PSESIP1:1;
      uint16_t PSESIP2:1;
    };
  };
} IPC18BITS;
extern volatile IPC18BITS IPC18bits __attribute__((__sfr__));

#define IPC23 IPC23
extern volatile uint16_t IPC23 __attribute__((__sfr__));
__extension__ typedef struct tagIPC23BITS {
  union {
    struct {
      uint16_t :8;
      uint16_t PWM1IP:3;
      uint16_t :1;
      uint16_t PWM2IP:3;
    };
    struct {
      uint16_t :8;
      uint16_t PWM1IP0:1;
      uint16_t PWM1IP1:1;
      uint16_t PWM1IP2:1;
      uint16_t :1;
      uint16_t PWM2IP0:1;
      uint16_t PWM2IP1:1;
      uint16_t PWM2IP2:1;
    };
  };
} IPC23BITS;
extern volatile IPC23BITS IPC23bits __attribute__((__sfr__));

#define IPC24 IPC24
extern volatile uint16_t IPC24 __attribute__((__sfr__));
__extension__ typedef struct tagIPC24BITS {
  union {
    struct {
      uint16_t PWM3IP:3;
      uint16_t :1;
      uint16_t PWM4IP:3;
      uint16_t :1;
      uint16_t PWM5IP:3;
    };
    struct {
      uint16_t PWM3IP0:1;
      uint16_t PWM3IP1:1;
      uint16_t PWM3IP2:1;
      uint16_t :1;
      uint16_t PWM4IP0:1;
      uint16_t PWM4IP1:1;
      uint16_t PWM4IP2:1;
      uint16_t :1;
      uint16_t PWM5IP0:1;
      uint16_t PWM5IP1:1;
      uint16_t PWM5IP2:1;
    };
  };
} IPC24BITS;
extern volatile IPC24BITS IPC24bits __attribute__((__sfr__));

#define IPC25 IPC25
extern volatile uint16_t IPC25 __attribute__((__sfr__));
__extension__ typedef struct tagIPC25BITS {
  union {
    struct {
      uint16_t :12;
      uint16_t AC2IP:3;
    };
    struct {
      uint16_t :12;
      uint16_t AC2IP0:1;
      uint16_t AC2IP1:1;
      uint16_t AC2IP2:1;
    };
  };
} IPC25BITS;
extern volatile IPC25BITS IPC25bits __attribute__((__sfr__));

#define IPC26 IPC26
extern volatile uint16_t IPC26 __attribute__((__sfr__));
__extension__ typedef struct tagIPC26BITS {
  union {
    struct {
      uint16_t AC3IP:3;
      uint16_t :1;
      uint16_t AC4IP:3;
    };
    struct {
      uint16_t AC3IP0:1;
      uint16_t AC3IP1:1;
      uint16_t AC3IP2:1;
      uint16_t :1;
      uint16_t AC4IP0:1;
      uint16_t AC4IP1:1;
      uint16_t AC4IP2:1;
    };
  };
} IPC26BITS;
extern volatile IPC26BITS IPC26bits __attribute__((__sfr__));

#define IPC27 IPC27
extern volatile uint16_t IPC27 __attribute__((__sfr__));
__extension__ typedef struct tagIPC27BITS {
  union {
    struct {
      uint16_t :8;
      uint16_t ADCAN0IP:3;
      uint16_t :1;
      uint16_t ADCAN1IP:3;
    };
    struct {
      uint16_t :8;
      uint16_t ADCAN0IP0:1;
      uint16_t ADCAN0IP1:1;
      uint16_t ADCAN0IP2:1;
      uint16_t :1;
      uint16_t ADCAN1IP0:1;
      uint16_t ADCAN1IP1:1;
      uint16_t ADCAN1IP2:1;
    };
  };
} IPC27BITS;
extern volatile IPC27BITS IPC27bits __attribute__((__sfr__));

#define IPC28 IPC28
extern volatile uint16_t IPC28 __attribute__((__sfr__));
__extension__ typedef struct tagIPC28BITS {
  union {
    struct {
      uint16_t ADCAN2IP:3;
      uint16_t :1;
      uint16_t ADCAN3IP:3;
      uint16_t :1;
      uint16_t ADCAN4IP:3;
      uint16_t :1;
      uint16_t ADCAN5IP:3;
    };
    struct {
      uint16_t ADCAN2IP0:1;
      uint16_t ADCAN2IP1:1;
      uint16_t ADCAN2IP2:1;
      uint16_t :1;
      uint16_t ADCAN3IP0:1;
      uint16_t ADCAN3IP1:1;
      uint16_t ADCAN3IP2:1;
      uint16_t :1;
      uint16_t ADCAN4IP0:1;
      uint16_t ADCAN4IP1:1;
      uint16_t ADCAN4IP2:1;
      uint16_t :1;
      uint16_t ADCAN5IP0:1;
      uint16_t ADCAN5IP1:1;
      uint16_t ADCAN5IP2:1;
    };
  };
} IPC28BITS;
extern volatile IPC28BITS IPC28bits __attribute__((__sfr__));

#define IPC29 IPC29
extern volatile uint16_t IPC29 __attribute__((__sfr__));
__extension__ typedef struct tagIPC29BITS {
  union {
    struct {
      uint16_t ADCAN6IP:3;
      uint16_t :1;
      uint16_t ADCAN7IP:3;
    };
    struct {
      uint16_t ADCAN6IP0:1;
      uint16_t ADCAN6IP1:1;
      uint16_t ADCAN6IP2:1;
      uint16_t :1;
      uint16_t ADCAN7IP0:1;
      uint16_t ADCAN7IP1:1;
      uint16_t ADCAN7IP2:1;
    };
  };
} IPC29BITS;
extern volatile IPC29BITS IPC29bits __attribute__((__sfr__));

#define IPC35 IPC35
extern volatile uint16_t IPC35 __attribute__((__sfr__));
__extension__ typedef struct tagIPC35BITS {
  union {
    struct {
      uint16_t :8;
      uint16_t ICDIP:3;
      uint16_t :1;
      uint16_t JTAGIP:3;
    };
    struct {
      uint16_t :8;
      uint16_t ICDIP0:1;
      uint16_t ICDIP1:1;
      uint16_t ICDIP2:1;
      uint16_t :1;
      uint16_t JTAGIP0:1;
      uint16_t JTAGIP1:1;
      uint16_t JTAGIP2:1;
    };
  };
} IPC35BITS;
extern volatile IPC35BITS IPC35bits __attribute__((__sfr__));

#define IPC37 IPC37
extern volatile uint16_t IPC37 __attribute__((__sfr__));
__extension__ typedef struct tagIPC37BITS {
  union {
    struct {
      uint16_t :12;
      uint16_t ADCAN8IP:3;
    };
    struct {
      uint16_t :12;
      uint16_t ADCAN8IP0:1;
      uint16_t ADCAN8IP1:1;
      uint16_t ADCAN8IP2:1;
    };
  };
} IPC37BITS;
extern volatile IPC37BITS IPC37bits __attribute__((__sfr__));

#define IPC38 IPC38
extern volatile uint16_t IPC38 __attribute__((__sfr__));
__extension__ typedef struct tagIPC38BITS {
  union {
    struct {
      uint16_t ADCAN9IP:3;
      uint16_t :1;
      uint16_t ADCAN10IP:3;
      uint16_t :1;
      uint16_t ADCAN11IP:3;
      uint16_t :1;
      uint16_t ADCAN12IP:3;
    };
    struct {
      uint16_t ADCAN9IP0:1;
      uint16_t ADCAN9IP1:1;
      uint16_t ADCAN9IP2:1;
      uint16_t :1;
      uint16_t ADCAN10IP0:1;
      uint16_t ADCAN10IP1:1;
      uint16_t ADCAN10IP2:1;
      uint16_t :1;
      uint16_t ADCAN11IP0:1;
      uint16_t ADCAN11IP1:1;
      uint16_t ADCAN11IP2:1;
      uint16_t :1;
      uint16_t ADCAN12IP0:1;
      uint16_t ADCAN12IP1:1;
      uint16_t ADCAN12IP2:1;
    };
  };
} IPC38BITS;
extern volatile IPC38BITS IPC38bits __attribute__((__sfr__));

#define IPC39 IPC39
extern volatile uint16_t IPC39 __attribute__((__sfr__));
__extension__ typedef struct tagIPC39BITS {
  union {
    struct {
      uint16_t :4;
      uint16_t ADCAN14IP:3;
    };
    struct {
      uint16_t :4;
      uint16_t ADCAN14IP0:1;
      uint16_t ADCAN14IP1:1;
      uint16_t ADCAN14IP2:1;
    };
  };
} IPC39BITS;
extern volatile IPC39BITS IPC39bits __attribute__((__sfr__));

#define IPC40 IPC40
extern volatile uint16_t IPC40 __attribute__((__sfr__));
__extension__ typedef struct tagIPC40BITS {
  union {
    struct {
      uint16_t ADCAN17IP:3;
      uint16_t :1;
      uint16_t ADCAN18IP:3;
      uint16_t :1;
      uint16_t ADCAN19IP:3;
      uint16_t :1;
      uint16_t ADCAN20IP:3;
    };
    struct {
      uint16_t ADCAN17IP0:1;
      uint16_t ADCAN17IP1:1;
      uint16_t ADCAN17IP2:1;
      uint16_t :1;
      uint16_t ADCAN18IP0:1;
      uint16_t ADCAN18IP1:1;
      uint16_t ADCAN18IP2:1;
      uint16_t :1;
      uint16_t ADCAN19IP0:1;
      uint16_t ADCAN19IP1:1;
      uint16_t ADCAN19IP2:1;
      uint16_t :1;
      uint16_t ADCAN20IP0:1;
      uint16_t ADCAN20IP1:1;
      uint16_t ADCAN20IP2:1;
    };
  };
} IPC40BITS;
extern volatile IPC40BITS IPC40bits __attribute__((__sfr__));

